src/InformationRegisters/ОбменЕРПСотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ОбменЕРПСотрудники</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИдентификаторЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CommonModules/ОбменЕРПСотрудники/Ext/Module.bsl
Процедура ЗаписатьДанныеДляОбмена(источник, Отказ)    Экспорт
	
	Если источник.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	Если Не Константы.ОбменЕРПСотрудники.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ОбменЕРПСотрудники.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Сотрудник.Установить(Источник.Ссылка);
	Запись = НаборЗаписей.Добавить();
	Запись.Сотрудник	= Источник.Ссылка;
	Запись.ИдентификаторЗаписи				= Строка(Новый УникальныйИдентификатор);

	Попытка
		НаборЗаписей.Записать();
	Исключение
		ОбщегоНазначения.СообщитьОбОшибке("Не удалось записать данные для обмена с ЕРП об ответственном лице : " + ОписаниеОшибки());
		Отказ = Истина;
	КонецПопытки;
		
КонецПроцедуры
